0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*  Windows port by SIMFLOW Technologies                                     *\
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    arch        "LSB;label=32;scalar=64";
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (14 0 0);

boundaryField
{
    boundaries
    {
        type            slip;
    }
    
    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    
    inlet
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -14;
    }
    
    car1
    {
        type            noSlip;
    }
}


// ************************************************************************* //
