0/k
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volScalarField;
	location            "0";
	object              k;
}


dimensions	[0 2 -2 0 0 0 0];

internalField	uniform 1.0;

boundaryField
{
	boundaries
	{
		type	zeroGradient;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 1.0;
	}
	inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 1.0;
		intensity	5.0E-5;
	}
	car1
	{
		type	kqRWallFunction;
		value	uniform 1.0;
	}
}
