0/nut
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volScalarField;
	location            "0";
	object              nut;
}


dimensions	[0 2 -1 0 0 0 0];

internalField	uniform 1.0;

boundaryField
{
	boundaries
	{
		type	calculated;
		value	uniform 1.0;
	}
	outlet
	{
		type	calculated;
		value	uniform 1.0;
	}
	inlet
	{
		type	calculated;
		value	uniform 1.0;
	}
	car1
	{
		type	nutUWallFunction;
		value	uniform 1.0;
	}
}
