0/omega
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volScalarField;
	location            "0";
	object              omega;
}


dimensions	[0 0 -1 0 0 0 0];

internalField	uniform 1.0;

boundaryField
{
	boundaries
	{
		type	zeroGradient;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 1.0;
	}
	inlet
	{
		type	turbulentMixingLengthFrequencyInlet;
		value	uniform 1.0;
		mixingLength	1.0E-5;
	}
	car1
	{
		type	omegaWallFunction;
		value	uniform 1.0;
	}
}
