0/p
FoamFile
{
	version             2.0;
	format              binary;
	arch                "LSB;label=32;scalar=64";
	class               volScalarField;
	location            "0";
	object              p;
}


dimensions	[0 2 -2 0 0 0 0];

internalField	uniform 0.0;

boundaryField
{
	boundaries
	{
		type	zeroGradient;
	}
	outlet
	{
		type	fixedValue;
		value	uniform 0.0;
	}
	inlet
	{
		type	zeroGradient;
	}
	car1
	{
		type	zeroGradient;
	}
}
