constant/turbulenceProperties
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"constant";
	object	turbulenceProperties;
}
simulationType	RAS;
RAS
{
	//printCoeffs	on;
	RASModel	kOmegaSST;
	turbulence	true;
}
