system/blockMeshDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	blockMeshDict;
}
convertToMeters	1;
edges	
(
);
vertices	
(
	(-1.0 -1.0 -1.0)
	(1.0 -1.0 -1.0)
	(1.0 1.0 -1.0)
	(-1.0 1.0 -1.0)
	(-1.0 -1.0 1.0)
	(1.0 -1.0 1.0)
	(1.0 1.0 1.0)
	(-1.0 1.0 1.0)
);
blocks	
(
	hex (0 1 2 3 4 5 6 7) (30 30 30) simpleGrading (1.0 1.0 1.0)
);
boundary	
(
		boundaries
	{
		type patch;
		faces
		(
			(1 5 4 0)
			(3 7 6 2)
			(0 3 2 1)
			(4 5 6 7)
		);
	}

		outlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}

		inlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}

);
