system/controlDict
FoamFile
{
	version	2.0;
	class	dictionary;
	format	ascii;
	location	"system";
	object	controlDict;
}
application	simpleFoam;
startFrom	latestTime;
startTime	0;
stopAt	endTime;
endTime	1000.0;
deltaT	1.0;
writeControl	timeStep;
writeInterval	10.0;
purgeWrite	2;
timeFormat	general;
timePrecision	6;
writeFormat	binary;
writePrecision	7;
writeCompression	uncompressed;
runTimeModifiable	true;